load-test.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 30
      arrivalRate: 5
      name: "Warm up"
    - duration: 60
      arrivalRate: 20
      rampTo: 50
      name: "Ramp up load"
    - duration: 60
      arrivalRate: 50
      name: "Sustained load"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Browse and View PDF"
    flow:
      - get:
          url: "/api/pdfs"
          capture:
            - json: "$.data[0]._id"
              as: "pdfId"
      - think: 1
      - get:
          url: "/api/pdfs/{{ pdfId }}"
          ifTrue: "pdfId"